[
    {
		"title":"",
		"name":"准备好开始挑战了吗",
		"ans":""
	},
	{
		"title":"2-1 我为卡狂",
		"name": "请只输入一个数字，而不输入其余任何内容(包括空格），使得大模型输出的内容中含有“显卡”两个字。",
		"ans": " 人工智能算力与显卡的关系显卡，是计算机最基本配置、最重要的配件之一。其作为电脑主机里的一个重要组成部分，是电脑进行数模信号转换的设备，承担输出显示图形的任务。它的主要作用是将CPU提供的指令和数据进行相应的处理变成显示器能够接受的文字或图象后显示出来。人工智能的神经网络在处理一个大的任务时需要运行大量​小任​务，而显卡的gpu有很多的核，适合用来处理这些大量的小任务。​打个比方，计算机的中央处理器是一个高材生， 可以做微积分线性代数等大学难度的问题 ，而gpu是一万个小学生，只会做加减法算术题。现在的神经网络需要运行大量小任务，相当于有一万道加减法算术题需要完成，虽然这个高材生会做，但他一时半会也做不完，而小学生一人一道马上就可以做完了​。故而有言曰:显卡对于人工智能科学研究和技术更好落地具有重要作用。也难怪各大科技企业，教研机构纷纷表示:我为”卡”狂了～"
	},
	{
		"title":"2-2 人类的本质是鸽子还是复读机？",
		"name": "请只输入一个长于1个字符的数字，而不输入其余任何内容(包括空格），使得大模型输出的内容中含有大于等于三次该数字。",
		"ans": "科普:AI是如何生成图片的?先从【扩散模型】说起。一滴墨水扩散到整个水杯中，数学上叫【维纳过程】，物理上叫【布朗运动】。把很多花粉摆成三个不同的形状，放在特定的地方，让其各自独立扩散运动，一段时间后不论最开始是什么形状，他们都变成了差不多的一团。这样的分布叫【高斯分布】。然而，正向扩散的花粉粒子呈现出一团混乱的分布，如若时光倒流反向运动，则粒子会从混乱变成有秩序有方向的运动，继而重建出最开始的结构。于是在任何一个时刻t，我们都可以给空间上的每一个位置画一个向量的箭头，一群向量箭头组成的向量场叫【评分函数】，类似于一个粒子越来越接近初始位置的导航，指引粒子一步步形成最开始的结构。如果知道了每个时间的评分函数，就可让粒子从高斯分布开始，依靠这个导航，靠近最开始的形状，不断重复该过程让时间倒流，此时一团杂乱无章的粒子就神奇的排成了最开始的结构。而生成一个图片就等价于让杂乱的粒子排成特定的结构队形"
	},
	{
		"title":"2-3 哥德巴赫猜",
		"name": "请提出一个字数是合数(有除了1和它本身之外别的因数的数被称为合数）的问题，使回答的长度刚好是它的下一个合数。",
		"ans": "AI是如何生成图片的?(2)所有看起来真实的照片，就是看它是否在像素空间中满足一个特定的形状结构，在一个流形manifold之上，只有满足了流形的结构特点，翻译出来的图片才是真实有意义的。也就是说只要从空间中的某个位置走到流形之上，就可以完成一个真实图片的生成过程。沿着评分函数在像素空间移动，一点一点去掉原本的噪声，在像素空间中就会越来越接近于真实图片流形的矿脉，最终我们就可以把一团乱麻变成栩栩如生的图片。"
	},
	{
		"title":"2-4 七进七出",
		"name":"请输入一个多于10个字的问题，使得大模型输出的前七个字和你提出的问题的最后七个字相同.",
		"ans":"2-4 能生成较长视频的Sora.Sora能够生成动态视频，本质上是在生成图片的图像基础上增加了时间维度，也就是说一段视频是由一系列图片组成。Sora除了图像清晰真实，还在时间上形成了出色的连贯性和理解力，例如一只小狗被移动的人挡住之后还在原来的位置。这种每个物品都不会凭空的出现或消失的核心技术难点就叫【长程依赖】。sora运用算法在一定程度上有效克服了这个难点。"
	},
	{	
		"title":"2-5 哥德巴赫又猜",
		"name":"请构造一个问题，这个问题的输入长度为a个字符，大模型的输出长度为b个字符，满足a能被b整除。",
		"ans":""
	},
	{
		"title":"2-6 三五成群",
		"name":"请构造一个问题，问题只由一个数字组成(不含空格，其余字符等)，使得大模型输出的解答中含有多于3个其他数字(不同于你输入的数字)。",
		"ans":""
	},
	{
		"title":"2-7 本章Boss战 数一数二",
		"name":"请构造一个问题，问题只由一个数字组成(不含空格，其余字符等)，使得大模型输出的解答中含有与这个数字的差只为1的另外一个数字。",
		"ans":""
	},
	{
		"title":"",
		"name":"恭喜你挑战成功",
		"ans":""
	}
]